zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Sent/Sent/IfxSent_Sent.h
#include "Scu/Std/IfxScuWdt.h"
#include "Sent/Std/IfxSent.h"
#include "Cpu/Irq/IfxCpu_Irq.h"

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Sent_Sent_Structures
 * \{ */
/** \brief Specifies the Interrupt type enables structure
 */
typedef struct
{
    uint8 receiveDataInterrupt;                     /**< \brief Specifies receive data interrupt enable */
    uint8 receiveSuccessInterrupt;                  /**< \brief Specifies receive success interrupt enable */
    uint8 receiveBufferOverflowInterrupt;           /**< \brief Specifies receive buffer overflow interrupt enable */
    uint8 transferDataInterrupt;                    /**< \brief Specifies transfer data interrupt enable */
    uint8 transferBufferUnderflowInterrupt;         /**< \brief Specifies transfer buffer underflow interrupt enable */
    uint8 serialDataReceiveInterrupt;               /**< \brief Specifies serial data interrupt enable */
    uint8 watchdogErrorInterrupt;                   /**< \brief Specifies watchdog error interrupt enable */
    uint8 serialDataCrcErrorInterrupt;              /**< \brief Specifies serial data CRC error interrupt enable */
    uint8 wrongStatusNibbleErrorInterrupt;          /**< \brief Specifies wrong status nibble error interrupt enable */
    uint8 crcErrorInterrupt;                        /**< \brief Specifies CRC error interrupt enable */
    uint8 nibblesValueOutOfRangeErrorInterrupt;     /**< \brief Specifies nibble value out of range error interrupt enable */
    uint8 nibblesWrongErrorInterrupt;               /**< \brief Specifies nibbles wrong error interrupt enable */
    uint8 frequencyDriftErrorInterrupt;             /**< \brief Specifies frequency drift error interrupt enable */
    uint8 frequencyRangeErrorInterrupt;             /**< \brief Specifies frequency not in the range error interrupt enable */
} IfxSent_Sent_Enable;

/** \} */

/** \addtogroup IfxLld_Sent_Sent_Structures
 * \{ */
/** \brief Specifies SENT handle structure
 */
typedef struct
{
    Ifx_SENT *sent;     /**< \brief Specifies pointer to SENT registers */
} IfxSent_Sent;

/** \brief Specifies interrupt flags union . In addition it allows to write and read to/from all flags as once via the ALL member.
 */
typedef union
{
    uint32              ALL;        /**< \brief Specifies to write and read to/from all flags as once via the ALL member. */
    IfxSent_Sent_Enable enable;     /**< \brief Structure contains the interrupt flags */
} IfxSent_Sent_EnabledInterrupts;

/** \brief Specifies the input output control properties
 */
typedef struct
{
    boolean                       inputPulsePolarityHigh;       /**< \brief Specifies the polarity of input of each channel */
    boolean                       outputPulsePolarityHigh;      /**< \brief Specifies the polarity of input of each channel */
    boolean                       edgeCounterCleared;           /**< \brief Specifies the edge counter reset */
    boolean                       glitchFallingCleared;         /**< \brief Specifies the glitch falling edge clear */
    boolean                       glitchRisingCleared;          /**< \brief Specifies the glitch rising edge clear */
    boolean                       triggerMonitorCleared;        /**< \brief Specifies the trigger monitor reset */
    IfxSent_DigitalGlitchesLength digitalGlitchFilterDepth;     /**< \brief Specifies the Digital Glitch Filter depth for input signal delay */
    IfxSent_ExternalTrigger       externalTrigger;              /**< \brief Specifies the external trigger line source */
} IfxSent_Sent_InputOutputControl;

/** \brief Specifies the interrupt control properties
 */
typedef struct
{
    uint16     priority;        /**< \brief Specifies the interrupt priority. Always 1 since all interrupts are handled at a time */
    IfxSrc_Tos isrProvider;     /**< \brief Specifies the interrupt service provider. CPU or DMA. */
} IfxSent_Sent_Interrupt;

/** \brief Specifies the interrupt control properties structure
 */
typedef struct
{
    IfxSent_InterruptNodePointer receiveSuccessInterruptNode;              /**< \brief Specifies the interrupt node for rsi request */
    IfxSent_InterruptNodePointer receiveDataInterruptNode;                 /**< \brief Specifies the interrupt node for rdi request */
    IfxSent_InterruptNodePointer receiveBufferOverflowInterruptNode;       /**< \brief Specifies the interrupt node for rbi request */
    IfxSent_InterruptNodePointer transferDataInterruptNode;                /**< \brief Specifies the interrupt node for tdi request */
    IfxSent_InterruptNodePointer transferBufferUnderflowInterruptNode;     /**< \brief Specifies the interrupt node for tbi request */
    IfxSent_InterruptNodePointer errorInterruptNode;                       /**< \brief Specifies the interrupt node for erri request */
    IfxSent_InterruptNodePointer serialDataReceiveInterruptNode;           /**< \brief Specifies the interrupt node for sdi request */
    IfxSent_InterruptNodePointer watchdogErrorInterruptNode;               /**< \brief Specifies the interrupt node for wdi request */
} IfxSent_Sent_InterruptNodeControl;

/** \brief Specifies the received nibbles control properties
 */
typedef struct
{
    IfxSent_Nibble nibblePointer0;     /**< \brief Specifies the received nibble0 control */
    IfxSent_Nibble nibblePointer1;     /**< \brief Specifies the received nibble1 control */
    IfxSent_Nibble nibblePointer2;     /**< \brief Specifies the received nibble2 control */
    IfxSent_Nibble nibblePointer3;     /**< \brief Specifies the received nibble3 control */
    IfxSent_Nibble nibblePointer4;     /**< \brief Specifies the received nibble4 control */
    IfxSent_Nibble nibblePointer5;     /**< \brief Specifies the received nibble5 control */
    IfxSent_Nibble nibblePointer6;     /**< \brief Specifies the received nibble6 control */
    IfxSent_Nibble nibblePointer7;     /**< \brief Specifies the received nibble7 control */
} IfxSent_Sent_NibbleControl;

/** \brief Specifies the pins configuration for SENT channel
 */
typedef struct
{
    const IfxSent_Sent_In *in;            /**< \brief Specifies input pin configuration */
    IfxPort_InputMode      inMode;        /**< \brief Specifies input pin mode */
    const IfxSent_Spc_Out *out;           /**< \brief Specifies output pin configuration */
    IfxPort_OutputMode     outMode;       /**< \brief Specifies output pin mode */
    IfxPort_PadDriver      pinDriver;     /**< \brief Pad driver mode definition */
} IfxSent_Sent_Pins;

/** \brief Specifies the receive control properties
 */
typedef struct
{
    boolean                         crcModeDisabled;                   /**< \brief Specifies the CRC mode disabled mode */
    boolean                         crcMethodDisabled;                 /**< \brief Specifies the CRC with zero nibbles disabled or enabled */
    boolean                         alternateCrcSelected;              /**< \brief Specifies the CRC is calculated for both fast and serial messages */
    boolean                         serialDataProcessingEnabled;       /**< \brief Specifies the serial data processing mode */
    boolean                         serialDataDisabledCrcDisabled;     /**< \brief Specifies the CRC disable for serial data disabled mode */
    boolean                         statusNibbleEnabled;               /**< \brief Specifies the status nibble to include in CRC */
    boolean                         driftErrorsDisabled;               /**< \brief Specifies the drift errors enabled or disabled */
    boolean                         endPulseIgnored;                   /**< \brief Specifies the pause pulse during synchronization */
    boolean                         suspendTriggered;                  /**< \brief Specifies the suspend trigger disables the channel or not */
    uint8                           frameLength;                       /**< \brief Specifies frame length in nibbles */
    IfxSent_FrameCheckMode          frameCheckMode;                    /**< \brief Specifies the frame check mode for valid frame */
    IfxSent_ExtendedSerialFrameMode extendedSerialFrameMode;           /**< \brief Specifies the extended serial frame mode */
} IfxSent_Sent_ReceiveControl;

/** \brief Specifies the SPC channel properties structure
 */
typedef struct
{
    uint8                 pulseLength;          /**< \brief Specifies the pulse length in ticktimes */
    uint8                 pulseDelayLength;     /**< \brief Specifies the pulse delay length */
    IfxSent_TriggerSource triggerSource;        /**< \brief Specifies the trigger source and mode */
    IfxSent_TimeBase      timeBase;             /**< \brief Specifies the pulse time base */
    IfxSent_SpcMode       spcMode;              /**< \brief Specifies the SENT SPC operational mode */
} IfxSent_Sent_TransmitControl;

